{
  "home": {
    "greeting": "Hi, my name is",
    "title": "Software Developer",
    "description": "I'm a passionate Full-Stack Developer with a love for crafting elegant code, solving intricate problems, automating tasks, and building engaging Single Page Applications."
  },
  "about": {
    "title": "About me",
    "intro": "At the moment, I'm immersed as a Full-Stack Developer at CF. My greatest passion in my work lies in crafting code at every stage to enhance user experiences and innovate solutions.",
    "learning": "I'm currently delving into backend web development using PHP, Symfony, and NestJS. Embracing new technologies and honing my skills are lifestyle choices for me.",
    "projects": "I'm continue to develop personal projects to improve my abilities.",
    "contact": "Feel free to reach out to me on",
    "or": "or via",
    "linkedin": "LinkedIn",
    "email": "Email.",
    "collaborate": "I'm always keen on collaborating on new projects and meeting new individuals!",
    "skills": "My Skills",
    "experience": "Experience"
  },
  "experience": {
    "title": "My career journey so far",
    "list": [
      {
        "company": "Content Fleet GmbH",
        "jobTitle": "Software Developer",
        "employmentType": "Full-time",
        "startDate": "Apr 2024",
        "endDate": "Present",
        "responsibilities": [
          "Developing and maintaining web applications using modern frameworks.",
          "Collaborating with cross-functional teams to define, design, and ship new features.",
          "Participating in code reviews to ensure code quality and best practices.",
          "Troubleshooting and debugging applications to optimize performance."
        ]
      },
      {
        "company": "GDS GmbH",
        "jobTitle": "Junior Software Developer",
        "employmentType": "Full-time",
        "startDate": "Sep 2022",
        "endDate": "Sep 2023",
        "responsibilities": [
          "Assistance in the development of a merchant platform (API and frontend) where merchants can configure and book advertising campaigns.",
          "Collaboration in the development of applications and websites.",
          "Working closely with other developers and team members to overcome complex technical challenges."
        ]
      },
      {
        "company": "CHECK24 Vergleichsportal GmbH",
        "jobTitle": "Junior Software Developer",
        "employmentType": "Full-time",
        "startDate": "Feb 2022",
        "endDate": "Jul 2022",
        "responsibilities": [
          "Maintenance and further development of the frontend, consisting of input forms and comparison results.",
          "Implementation of a new layout for input forms.",
          "Resolution of display and logic errors, especially on mobile devices.",
          "Adjustment of end-to-end tests."
        ]
      },
      {
        "company": "DCI Digital Career Institute gGmbH",
        "jobTitle": "Tutor",
        "employmentType": "Part-time",
        "startDate": "Oct 2020",
        "endDate": "Dec 2021",
        "responsibilities": [
          "4 hours per week of tutoring on the subject of web development for classmates.",
          "Independent planning and conceptualization of the tutorial.",
          "Designing exercises and addressing complex questions."
        ]
      }
    ]
  },
  "projects": {
    "title": "Projects",
    "murekkep": {
      "description": "Mürekkep is a blog site where writers publish personal posts and stay connected with their readers through updates on new content."
    },
    "notkutusu": {
      "description": "Not Kutusu is a web-based application designed for students of Istanbul Technical University (ITU) to upload and access lecture notes, promoting academic collaboration and resource sharing."
    },
    "gameofthrones": {
      "description": "A web application developed using Angular to fetch and display quotes from the Game of Thrones TV series."
    }
  },
  "contact": {
    "title": "Let’s Stay in Touch",
    "message": "While I'm not actively seeking new opportunities at the moment, feel free to reach out anytime. Whether you have a question or simply want to connect, I'll do my best to respond!",
    "button": "Let me know"
  },
  "nav": {
    "home": "Home",
    "about": "About",
    "experience": "Experience",
    "projects": "Projects",
    "contact": "Contact"
  },
  "footer": {
    "designedBy-I": "Designed & Built with",
    "designedBy-II": "by Yahya Yasir Koca.",
    "copyright": "© {{year}} All rights reserved."
  }
}
